# GetWallHeight

## Description
Returns the height at the start and at the end of a wall.

```pascal
PROCEDURE GetWallHeight(
				hWall             : HANDLE;
				VAR dStartTopHght : REAL;
				VAR dStartBotHght : REAL;
				VAR dEndTopHght   : REAL;
				VAR dEndBotHght   : REAL);
```

```python

def vs.GetWallHeight(hWall):
    return (dStartTopHght, dStartBotHght, dEndTopHght, dEndBotHght)
```

## Parameters
|Name|Type|Description|
|---|---|---|
|hWall|HANDLE||
|dStartTopHght|REAL||
|dStartBotHght|REAL||
|dEndTopHght|REAL||
|dEndBotHght|REAL||

## Version
Availability: from Vectorworks 2014
## Category
* Graphic Calculation